testCases/T3C4/EARSMlm2009/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;
        maxIter          100;
        smoother         DICGaussSeidel;
    }

    U
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1.e-6;
        relTol           0.01;
    }

    "(k|omega|gammaInt|ReThetat)"
    {
        $U;
        minIter          1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    pRefCell        0;
    pRefValue       0;

    consistent      yes;

}

relaxationFactors
{
    fields
    {
        p               1.0;
    }
    equations
    {
        U               0.8;
        k               0.6;
        omega           0.6;
        ReThetat        0.6;
        gammaInt        0.6;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
